Sketch is empty. Can't create Path Reinforcement.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId PathReinforcementEmptySketch { get; }
  Visual Basic
Public Shared ReadOnly Property PathReinforcementEmptySketch As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PathReinforcementEmptySketch {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace